In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sqlalchemy import create_engine
from pandas_profiling import ProfileReport

In [5]:
#files to load

hospital_profitability1 = "Resources/hospital-profitability-2009-2013.csv"
hospital_profitability2= "Resources/hospital-profitability-2009-2013-2.csv"

profit1= pd.read_csv(hospital_profitability1)
profit2=pd.read_csv(hospital_profitability2)

profit1.head()
profit2.head()

#merge or join datasets? they look the exact same have same values and colum names
# Combine the data into a single dataset
#profitcombo = pd.merge(profit1, profit2, how="left", on=["Year"])
#profitcombo.head()

,Year,Facility Number,Facility Name,Begin Date,End Date,County Name,Type of Control,Income Statement Item,Income Statement Amount,Amount per Adjusted Patient Day
0,2009,106010735.0,ALAMEDA HOSPITAL,07/01/2008,06/30/2009,Alameda,District,GR_PT_REV,282813469.0,5220.0
1,2009,106010735.0,ALAMEDA HOSPITAL,07/01/2008,06/30/2009,Alameda,District,DED_REV_PLUS_DSH,219753983.0,4056.0
2,2009,106010735.0,ALAMEDA HOSPITAL,07/01/2008,06/30/2009,Alameda,District,TOT_CAP_REV,0.0,0.0
3,2009,106010735.0,ALAMEDA HOSPITAL,07/01/2008,06/30/2009,Alameda,District,NET_REV_LESS_DSH,63059486.0,1164.0
4,2009,106010735.0,ALAMEDA HOSPITAL,07/01/2008,06/30/2009,Alameda,District,OTH_OP_REV,192252.0,4.0

In [6]:
#profit1.dropna()

In [7]:
#profit1.isna

In [8]:
#profile = ProfileReport(profit1, title='Pandas Profiling Report')

In [9]:
#profile = ProfileReport(profit1, title='Pandas Profiling Report', explorative=True)

In [10]:
profit1.describe()

,Year,Facility Number,Income Statement Amount,Amount per Adjusted Patient Day
count,28626.000000,2.856100e+04,2.846700e+04,26412.000000
mean,2010.987738,1.062803e+08,2.366011e+08,1689.733454
std,1.412739,1.370604e+05,5.025409e+09,3984.691115
min,2009.000000,1.060107e+08,-5.188873e+08,-31114.000000
25%,2010.000000,1.061903e+08,0.000000e+00,0.000000
50%,2011.000000,1.063011e+08,4.262760e+05,25.000000
75%,2012.000000,1.063714e+08,3.601716e+07,1174.250000
max,2013.000000,1.065810e+08,3.211040e+11,77402.000000

In [11]:
#Exact same dataset, no need to append
#profit2.head()

#profit2.describe()

In [12]:
#cleaning,possible joining

In [13]:
print (profit1.columns.tolist())

['Year', 'Facility Number', 'Facility Name', 'Begin Date', 'End Date', 'County Name', 'Type of Control', 'Income Statement Item', 'Income Statement Amount', 'Amount per Adjusted Patient Day']

In [14]:
#print (profit2.columns.tolist())

In [15]:
#pd.concatenate(dataframe1, dataframe2)

In [16]:
new_profit_df= profit1[["Year", "Facility Number", "Facility Name", "County Name", "Income Statement Amount"]]
new_profit_df.head()

,Year,Facility Number,Facility Name,County Name,Income Statement Amount
0,2009,106010735.0,ALAMEDA HOSPITAL,Alameda,282813469.0
1,2009,106010735.0,ALAMEDA HOSPITAL,Alameda,219753983.0
2,2009,106010735.0,ALAMEDA HOSPITAL,Alameda,0.0
3,2009,106010735.0,ALAMEDA HOSPITAL,Alameda,63059486.0
4,2009,106010735.0,ALAMEDA HOSPITAL,Alameda,192252.0

In [17]:
###Rename the column headers

In [18]:
### Rename the column headers


new_profit_df = new_profit_df.rename(columns={"Year": "year",
                                                  "Facility Number":"facility_number",
                                                  "Facility Name":"facility_name",
                                                  "County Name": "county_name",
                                                  "Income Statement Amount": "income_statement_amount"})


new_profit_df.drop_duplicates("facility_number", inplace=True)
new_profit_df.set_index("facility_number", inplace=True)

new_profit_df.head()

,year,facility_name,county_name,income_statement_amount
facility_number,,,,
106010735.0,2009,ALAMEDA HOSPITAL,Alameda,2.828135e+08
106010739.0,2009,ALTA BATES SUMMIT MED CTR-ALTA BATES CAMPUS,Alameda,2.107269e+09
106010776.0,2009,CHILDRENS HOSPITAL & RESEARCH CENTER AT OAKLAND,Alameda,9.325539e+08
106010782.0,2009,THUNDER ROAD CHEMICAL DEPENDENCY RECOVERY HOSP...,Alameda,2.280319e+06
106010805.0,2009,EDEN MEDICAL CENTER,Alameda,1.112786e+09

In [47]:
new_profit_df.shape

(463, 4)

In [45]:
new_profit_df.count()

year                       463
facility_name              462
county_name                463
income_statement_amount    463
dtype: int64

new_profit_df.shape()

In [46]:
new_profit_df=new_profit_df.sort_values('facility_name')
new_profit_df ['facility_name'].unique()[:50]

array(['ADVENTIST MEDICAL CENTER - HANFORD', 'AGNEWS STATE HOSPITAL',
       'AHMC ANAHEIM REGIONAL MEDICAL CENTER',
       'ALAMEDA COUNTY MEDICAL CENTER', 'ALAMEDA HOSPITAL',
       'ALHAMBRA HOSPITAL', 'ALTA BATES SUMMIT MED CTR-ALTA BATES CAMPUS',
       'ALTA BATES SUMMIT MED CTR-SUMMIT CAMPUS-HAWTHORNE',
       'ALVARADO HOSPITAL', 'ALVARADO PARKWAY INSTITUTE BHS',
       'AMERICAN RECOVERY CENTER', 'ANAHEIM GENERAL HOSPITAL',
       'ANTELOPE VALLEY HOSPITAL', 'ARROWHEAD REGIONAL MEDICAL CENTER',
       'ARROYO GRANDE COMMUNITY HOSPITAL', 'ATASCADERO STATE HOSPITAL',
       'AURORA BEHAVIORAL HEALTHCARE - SANTA ROSA', 'AURORA CHARTER OAK',
       'AURORA LAS ENCINAS HOSPITAL', 'AURORA SAN DIEGO',
       'AURORA VISTA DEL MAR HOSPITAL', 'BAKERSFIELD HEART HOSPITAL',
       'BAKERSFIELD MEMORIAL HOSPITAL', 'BALLARD REHABILITATION HOSPITAL',
       'BANNER LASSEN MEDICAL CENTER', 'BARLOW HOSPITAL',
       'BARSTOW COMMUNITY HOSPITAL', 'BARTON MEMORIAL HOSPITAL',
       'BEAR VALLEY COMMUNITY HOSPITAL', 'BELLFLOWER MEDICAL CENTER',
       'BETTY FORD CENTER OF EISENHOWER', 'BEVERLY HOSPITAL',
       'BHC ALHAMBRA HOSPITAL', 'BIGGS-GRIDLEY MEMORIAL HOSPITAL',
       'BROTMAN MEDICAL CENTER', 'BUTTE COUNTY MENTAL HEALTH - PHF',
       'CALIFORNIA HOSPITAL MEDICAL CENTER',
       'CALIFORNIA PACIFIC MEDICAL CENTER',
       "CALIFORNIA PACIFIC MEDICAL CTN-ST. LUKE'S CAMPUS",
       'CANYON RIDGE HOSPITAL',
       'CASA COLINA HOSPITAL FOR REHABILITATIVE MEDICINE',
       'CATALINA ISLAND MEDICAL CENTER', 'CEDARS-SINAI MEDICAL CENTER',
       'CENTINELA HOSPITAL MEDICAL CENTER',
       'CENTRAL VALLEY GENERAL HOSPITAL', 'CHAPMAN MEDICAL CENTER',
       "CHILDREN'S HOSPITAL AT MISSION",
       "CHILDREN'S HOSPITAL CENTRAL CALIFORNIA",
       "CHILDREN'S HOSPITAL OF LOS ANGELES",
       "CHILDREN'S HOSPITAL OF ORANGE COUNTY"], dtype=object)

In [20]:
new_profit_df=new_profit_df.sort_values('county_name')
new_profit_df ['county_name'].unique()

array(['Alameda', 'Amador', 'Butte', 'Calaveras', 'Colusa',
       'Contra Costa', 'Del Norte', 'El Dorado', 'Fresno', 'Glenn',
       'Humboldt', 'Imperial', 'Inyo', 'Kern', 'Kings', 'Lake', 'Lassen',
       'Los Angeles', 'Madera', 'Marin', 'Mariposa', 'Mendocino',
       'Merced', 'Modoc', 'Mono', 'Monterey', 'Napa', 'Nevada', 'Orange',
       'Placer', 'Plumas', 'Riverside', 'Sacramento', 'San Benito',
       'San Bernardino', 'San Diego', 'San Francisco', 'San Joaquin',
       'San Luis Obispo', 'San Mateo', 'Santa Barbara', 'Santa Clara',
       'Santa Cruz', 'Shasta', 'Siskiyou', 'Solano', 'Sonoma',
       'Stanislaus', 'Statewide', 'Sutter', 'Tehama', 'Trinity', 'Tulare',
       'Tuolumne', 'Ventura', 'Yolo', 'Yuba'], dtype=object)

In [21]:
new_profit_df=new_profit_df.sort_values('year')
new_profit_df ['year'].unique()

array([2009, 2010, 2011, 2012, 2013])

In [22]:
#new_profit_df=new_profit_df.sort_values('facility_number')
#new_profit_df ['facility_number'].unique()[:50]

In [23]:
from config import password

In [31]:
engine = create_engine(f'postgresql://postgres:{password}@localhost:5432/ETL_db')

In [34]:
#Confirm tables
engine.table_names()

['Profit']

In [35]:
#new_profit_df.to_sql(name ='Profit', con=engine, if_exists='append', index=True)

In [36]:
#how do I know I have selected the index I want

In [37]:
#PD.read_sql_query('select * from Year')

In [29]:
#pd.read_sql #("psotgresql://postres:Zooming1994"@localhost:5432/ETL_db")

<function pandas.io.sql.read_sql(sql, con, index_col=None, coerce_float=True, params=None, parse_dates=None, columns=None, chunksize: Union[int, NoneType] = None) -> Union[pandas.core.frame.DataFrame, Iterator[pandas.core.frame.DataFrame]]>